#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.bedtime will be created
  + resource "aws_cloudwatch_event_rule" "bedtime" {
      + arn                 = (known after apply)
      + description         = "Fires everyday @2:00 JST"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "yama-dev-env-prod-bedtime"
      + schedule_expression = "cron(0 17 ? * * *)"
      + tags                = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-bedtime"
          + "Stage"  = "prod"
        }
    }

  # aws_cloudwatch_event_target.goodnight will be created
  + resource "aws_cloudwatch_event_target" "goodnight" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "yama-dev-env-prod-bedtime"
      + target_id = "yama-dev-env-prod-goodnight"
    }

  # aws_cloudwatch_log_group.lambda_goodnight will be created
  + resource "aws_cloudwatch_log_group" "lambda_goodnight" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/yama-dev-env-prod-goodnight"
      + retention_in_days = 14
      + tags              = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-lambda-goodnight"
          + "Stage"  = "prod"
        }
    }

  # aws_cloudwatch_log_group.lambda_notify_teams will be created
  + resource "aws_cloudwatch_log_group" "lambda_notify_teams" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/yama-dev-env-prod-notify-teams"
      + retention_in_days = 14
      + tags              = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-lambda-notify-teams"
          + "Stage"  = "prod"
        }
    }

  # aws_cloudwatch_log_metric_filter.goodnight_anomaly will be created
  + resource "aws_cloudwatch_log_metric_filter" "goodnight_anomaly" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/yama-dev-env-prod-goodnight"
      + name           = "yama-dev-env-prod-goodnight-notify"
      + pattern        = "{$.loglevel = \"WARNING\" || $.loglevel = \"ERROR\"}"

      + metric_transformation {
          + name      = "goodnight-notify"
          + namespace = "yama/dev-env/prod/Lambda"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.goodnight_anomaly will be created
  + resource "aws_cloudwatch_metric_alarm" "goodnight_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm for goodnight lambda"
      + alarm_name                            = "yama-dev-env-prod-goodnight-notify"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "goodnight-notify"
      + namespace                             = "yama/dev-env/prod/Lambda"
      + period                                = 10
      + statistic                             = "SampleCount"
      + tags                                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-goodnight-notify"
          + "Stage"  = "prod"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_policy.lambda_goodnight_stop_my_instances will be created
  + resource "aws_iam_policy" "lambda_goodnight_stop_my_instances" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yama-dev-env-prod-lambda-goodnight-stop-my-instances"
      + path   = "/yama-dev-env-prod/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "ec2:StopInstances"
                      + Condition = {
                          + StringEquals = {
                              + ec2:ResourceTag/Author = "yamaguti-dxa"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:instance/*"
                      + Sid       = "LambdaGoodnightStopMyInstances"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.lambda_goodnight will be created
  + resource "aws_iam_role" "lambda_goodnight" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "yama-dev-env-prod-lambda-goodnight"
      + path                  = "/yama-dev-env/"
      + tags                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-lambda-goodnight"
          + "Stage"  = "prod"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_notify_teams will be created
  + resource "aws_iam_role" "lambda_notify_teams" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "yama-dev-env-prod-lambda-notify-teams"
      + path                  = "/yama-dev-env-prod/"
      + tags                  = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-lambda-notify-teams"
          + "Stage"  = "prod"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.goodnight_ec2_ro will be created
  + resource "aws_iam_role_policy_attachment" "goodnight_ec2_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ReadOnlyAccess"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.goodnight_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "goodnight_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.goodnight_stop_my_instances will be created
  + resource "aws_iam_role_policy_attachment" "goodnight_stop_my_instances" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.notify_teams_cloudwatchlogs_ro will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_cloudwatchlogs_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsReadOnlyAccess"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.notify_teams_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.notify_teams_ssm_ro will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_ssm_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = (known after apply)
    }

  # aws_instance.dev will be created
  + resource "aws_instance" "dev" {
      + ami                          = "ami-0f310fced6141e627"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "yama-yamaguti-dxa"
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-dev"
          + "Stage"  = "prod"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-ig"
          + "Stage"  = "prod"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lambda_function.goodnight will be created
  + resource "aws_lambda_function" "goodnight" {
      + arn                            = (known after apply)
      + filename                       = "lambda/artifacts/goodnight.zip"
      + function_name                  = "yama-dev-env-prod-goodnight"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + source_code_hash               = "tpNtwBNjTnOmMtT6CPr7EfylbAMlNy7VhjMWda4g1zU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-goodnight"
          + "Stage"  = "prod"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.notify_teams will be created
  + resource "aws_lambda_function" "notify_teams" {
      + arn                            = (known after apply)
      + filename                       = "lambda/artifacts/notify_teams.zip"
      + function_name                  = "yama-dev-env-prod-notify-teams"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + source_code_hash               = "i8ythtOTtVmI7ttYhO0zIuW3aSiysajwBBHfUygLGP8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-notify-teams"
          + "Stage"  = "prod"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TEAMS_WEBHOOK_URL_SSM_NAME" = "yama-dev-env-teams-webhook-url"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_goodnight will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_goodnight" {
      + action        = "lambda:InvokeFunction"
      + function_name = "yama-dev-env-prod-goodnight"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.sns_notify_teams will be created
  + resource "aws_lambda_permission" "sns_notify_teams" {
      + action        = "lambda:InvokeFunction"
      + function_name = "yama-dev-env-prod-notify-teams"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS"
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-public-rt"
          + "Stage"  = "prod"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.public will be created
  + resource "aws_security_group" "public" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all outgoing"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow ssh incoming from any network"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "10.100.0.0/16",
                ]
              + description      = "allow icmp incoming from vpc network"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + name                   = "yama-dev-env-prod-public-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-public-sg"
          + "Stage"  = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_sns_topic.default will be created
  + resource "aws_sns_topic" "default" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yama-dev-env-prod"
      + policy = (known after apply)
      + tags   = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod"
          + "Stage"  = "prod"
        }
    }

  # aws_sns_topic_subscription.teams will be created
  + resource "aws_sns_topic_subscription" "teams" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = (known after apply)
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.100.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod-public"
          + "Stage"  = "prod"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.default will be created
  + resource "aws_vpc" "default" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.100.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Author" = "yamaguti-dxa"
          + "Name"   = "yama-dev-env-prod"
          + "Stage"  = "prod"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
